xpacks/stm32f7-cmsis/CMSIS/Driver/OTG_FS_STM32F7xx.h
#define OTG_FS_BASE           (AHB2PERIPH_BASE)
#define OTG_FS_DFIFO0_BASE    (OTG_FS_BASE + 0x01000U)
#define OTG_FS_DFIFO1_BASE    (OTG_FS_BASE + 0x02000U)
#define OTG_FS_DFIFO2_BASE    (OTG_FS_BASE + 0x03000U)
#define OTG_FS_DFIFO3_BASE    (OTG_FS_BASE + 0x04000U)
#define OTG_FS_DFIFO4_BASE    (OTG_FS_BASE + 0x05000U)
#define OTG_FS_DFIFO5_BASE    (OTG_FS_BASE + 0x06000U)
#define OTG_FS_DFIFO6_BASE    (OTG_FS_BASE + 0x07000U)
#define OTG_FS_DFIFO7_BASE    (OTG_FS_BASE + 0x08000U)

#define OTG_FS                ((OTG_FS_TypeDef *) OTG_FS_BASE)
#define OTG_FS_DFIFO0         (((uint32_t *) OTG_FS_DFIFO0_BASE) )
#define OTG_FS_DFIFO1         (((uint32_t *) OTG_FS_DFIFO1_BASE) )
#define OTG_FS_DFIFO2         (((uint32_t *) OTG_FS_DFIFO2_BASE) )
#define OTG_FS_DFIFO3         (((uint32_t *) OTG_FS_DFIFO3_BASE) )
#define OTG_FS_DFIFO4         (((uint32_t *) OTG_FS_DFIFO4_BASE) )
#define OTG_FS_DFIFO5         (((uint32_t *) OTG_FS_DFIFO5_BASE) )
#define OTG_FS_DFIFO6         (((uint32_t *) OTG_FS_DFIFO6_BASE) )
#define OTG_FS_DFIFO7         (((uint32_t *) OTG_FS_DFIFO7_BASE) )

// OTG_FS Host Channel

// [LNP]
#if defined ( __CC_ARM )
typedef __packed struct {               // Host Channel typedef (HC)
#else
typedef struct __packed {               // Host Channel typedef (HC)
#endif

  __packed union {
    uint32_t HCCHAR;                    // Channel Characteristics

    // [LNP]
    #if defined ( __CC_ARM )
    	__packed struct {
    #else
        struct __packed {
    #endif

      uint32_t MPSIZ     : 11;          // Endpoint Maximum Packet Size
      uint32_t EPNUM     :  4;          // Endpoint Number
      uint32_t EPDIR     :  1;          // Endpoint Direction
      uint32_t Reserved0 :  1;          // Reserved
      uint32_t LSDEV     :  1;          // Endpoint Low-speed
      uint32_t EPTYP     :  2;          // Endpoint Type
      uint32_t MCNT      :  2;          // Multicount
      uint32_t DAD       :  7;          // Device Address
      uint32_t ODDFRM    :  1;          // Periodic Transaction Odd Frame
      uint32_t CHDIS     :  1;          // Channel Disable
      uint32_t CHENA     :  1;          // Channel Enable
    };
  };
  uint32_t Reserved1;                   // Reserved
  __packed union {
    uint32_t HCINT;                     // Channel Interrupt

    // [LNP]
    #if defined ( __CC_ARM )
    	__packed struct {
    #else
        struct __packed {
    #endif

      uint32_t XFCR      :  1;          // Transfer Completed
      uint32_t CHH       :  1;          // Channel Halted
      uint32_t Reserved2 :  1;          // Reserved
      uint32_t STALL     :  1;          // STALL Response Received Interrupt
      uint32_t NAK       :  1;          // NAK Response Received Interrupt
      uint32_t ACK       :  1;          // ACK Response Rece/Transmit Int
      uint32_t Reserved3 :  1;          // Reserved
      uint32_t TXERR     :  1;          // Transaction Error
      uint32_t BBERR     :  1;          // Babble Error
      uint32_t FRMOR     :  1;          // Frame Overrun
      uint32_t DTERR     :  1;          // Data Toggle Error
    };
  };
  __packed union {
    uint32_t HCINTMSK;                  // Channel Interrupt Mask

    // [LNP]
    #if defined ( __CC_ARM )
    	__packed struct {
    #else
        struct __packed {
    #endif

      uint32_t XFCRM     :  1;          // Transfer Completed Mask
      uint32_t CHHM      :  1;          // Channel Halted Mask
      uint32_t Reserved4 :  1;          // Reserved
      uint32_t STALLM    :  1;          // STALL Response Rece Interrupt Mask
      uint32_t NAKM      :  1;          // NAK Response Rece Interrupt Mask
      uint32_t ACKM      :  1;          // ACK Response Rece/Transmit Int Mask
      uint32_t Reserved5 :  1;          // Reserved
      uint32_t TXERRM    :  1;          // Transaction Error Mask
      uint32_t BBERRM    :  1;          // Babble Error Mask
      uint32_t FRMORM    :  1;          // Frame Overrun Mask
      uint32_t DTERRM    :  1;          // Data Toggle Error Mask
    };
  };
  __packed union {
    uint32_t HCTSIZ;                    // Channel Transfer Size

    // [LNP]
    #if defined ( __CC_ARM )
    	__packed struct {
    #else
        struct __packed {
    #endif

      uint32_t XFRSIZ    : 19;          // Transfer Size
      uint32_t PKTCNT    : 10;          // Packet Count
      uint32_t DPID      :  2;          // Data PID
      uint32_t Reserved6 :  1;          // Reserved
    };
  };
  uint32_t Reserved7;                   // Reserved
  uint32_t Reserved8;                   // Reserved
  uint32_t Reserved9;                   // Reserved
} OTG_FS_HC;

// [LNP]
#if defined ( __CC_ARM )
#pragma pop
#endif

// OTG_FS control and status register (OTG_FS_GOTGCTL)
#define  OTG_FS_GOTGCTL_SRQSCS              ((uint32_t)    1U       )
#define  OTG_FS_GOTGCTL_SRQ                 ((uint32_t)    1U  <<  1)
#define  OTG_FS_GOTGCTL_VBVALOEN            ((uint32_t)    1U  <<  2)
#define  OTG_FS_GOTGCTL_VBVALOVAL           ((uint32_t)    1U  <<  3)
#define  OTG_FS_GOTGCTL_ABVALOEN            ((uint32_t)    1U  <<  4)
#define  OTG_FS_GOTGCTL_ABVALOVAL           ((uint32_t)    1U  <<  5)
#define  OTG_FS_GOTGCTL_BVALOEN             ((uint32_t)    1U  <<  6)
#define  OTG_FS_GOTGCTL_BVALOVAL            ((uint32_t)    1U  <<  7)
#define  OTG_FS_GOTGCTL_HNGSCS              ((uint32_t)    1U  <<  8)
#define  OTG_FS_GOTGCTL_HNPRQ               ((uint32_t)    1U  <<  9)
#define  OTG_FS_GOTGCTL_HSHNPEN             ((uint32_t)    1U  << 10)
#define  OTG_FS_GOTGCTL_DHNPEN              ((uint32_t)    1U  << 11)
#define  OTG_FS_GOTGCTL_EHEN                ((uint32_t)    1U  << 12)
#define  OTG_FS_GOTGCTL_CIDSTS              ((uint32_t)    1U  << 16)
#define  OTG_FS_GOTGCTL_DBCT                ((uint32_t)    1U  << 17)
#define  OTG_FS_GOTGCTL_ASVLD               ((uint32_t)    1U  << 18)
#define  OTG_FS_GOTGCTL_BSVLD               ((uint32_t)    1U  << 19)
#define  OTG_FS_GOTGCTL_OTGVER              ((uint32_t)    1U  << 20)

