xpacks/stm32f7-cmsis/CMSIS/Driver/OTG_FS_STM32F7xx.h
// OTG_FS Host non-periodic transmit FIFO size register (OTG_FS_HNPTXFSIZ)
#define  OTG_FS_HNPTXFSIZ_NPTXFSA_POS       ((uint32_t)           0U)
#define  OTG_FS_HNPTXFSIZ_NPTXFSA_MSK       ((uint32_t)0xFFFFU      )
#define  OTG_FS_HNPTXFSIZ_NPTXFSA(x)       (((uint32_t)    x        ) & OTG_FS_HNPTXFSIZ_NPTXFSA_MSK)
#define  OTG_FS_HNPTXFSIZ_NPTXFD_POS        ((uint32_t)           16U)
#define  OTG_FS_HNPTXFSIZ_NPTXFD_MSK        ((uint32_t)0xFFFFU << OTG_FS_HNPTXFSIZ_NPTXFD_POS)
#define  OTG_FS_HNPTXFSIZ_NPTXFD(x)        (((uint32_t)    x   << OTG_FS_HNPTXFSIZ_NPTXFD_POS) & OTG_FS_HNPTXFSIZ_NPTXFD_MSK)

// OTG_FS Endpoint 0 transmit FIFO size register (OTG_FS_DIEPTXF0)
#define  OTG_FS_DIEPTXF0_TX0FSA_POS         ((uint32_t)           0U)
#define  OTG_FS_DIEPTXF0_TX0FSA_MSK         ((uint32_t)0xFFFFU      )
#define  OTG_FS_DIEPTXF0_TX0FSA(x)         (((uint32_t)    x        ) & OTG_FS_DIEPTXF0_TX0FSA_MSK)
#define  OTG_FS_DIEPTXF0_TX0FD_POS          ((uint32_t)           16U)
#define  OTG_FS_DIEPTXF0_TX0FD_MSK          ((uint32_t)0xFFFFU << OTG_FS_DIEPTXF0_TX0FD_POS)
#define  OTG_FS_DIEPTXF0_TX0FD(x)          (((uint32_t)    x   << OTG_FS_DIEPTXF0_TX0FD_POS) & OTG_FS_DIEPTXF0_TX0FD_MSK)

// OTG_FS Host non-periodic transmit FIFO/queue status register (OTG_FS_HNPTXSTS)
#define  OTG_FS_HNPTXSTS_NPTXFSAV_POS       ((uint32_t)           0U)
#define  OTG_FS_HNPTXSTS_NPTXFSAV_MSK       ((uint32_t)0xFFFFU      )
#define  OTG_FS_HNPTXSTS_NPTXFSAV(x)       (((uint32_t)    x        ) & OTG_FS_HNPTXSTS_NPTXFSAV_MSK)
#define  OTG_FS_HNPTXSTS_NPTQXSAV_POS       ((uint32_t)           16U)
#define  OTG_FS_HNPTXSTS_NPTQXSAV_MSK       ((uint32_t) 0xFFU  << OTG_FS_HNPTXSTS_NPTQXSAV_POS)
#define  OTG_FS_HNPTXSTS_NPTQXSAV(x)       (((uint32_t)    x   << OTG_FS_HNPTXSTS_NPTQXSAV_POS) & OTG_FS_HNPTXSTS_NPTQXSAV_MSK)
#define  OTG_FS_HNPTXSTS_NPTXQTOP_POS       ((uint32_t)           24U)
#define  OTG_FS_HNPTXSTS_NPTXQTOP_MSK       ((uint32_t) 0x7FU  << OTG_FS_HNPTXSTS_NPTXQTOP_POS)
#define  OTG_FS_HNPTXSTS_NPTXQTOP(x)       (((uint32_t)    x   << OTG_FS_HNPTXSTS_NPTXQTOP_POS) & OTG_FS_HNPTXSTS_NPTXQTOP_MSK)

// OTG_FS general core configuration register (OTG_FS_GCCFG)
#define  OTG_FS_GCCFG_PWRDWN                ((uint32_t)    1U  << 16)
#define  OTG_FS_GCCFG_VBDEN                 ((uint32_t)    1U  << 21)

// OTG_FS core LPM configuration register (OTG_FS_GLPMCFG)
#define  OTG_FS_GLPMCFG_LPMEN               ((uint32_t)    1U       )
#define  OTG_FS_GLPMCFG_LPMACK              ((uint32_t)    1U  <<  1)
#define  OTG_FS_GLPMCFG_BESL_POS            ((uint32_t)           2U)
#define  OTG_FS_GLPMCFG_BESL_MSK            ((uint32_t)  0x0FU << OTG_FS_GLPMCFG_BESL_POS)
#define  OTG_FS_GLPMCFG_BESL(x)            (((uint32_t)    x   << OTG_FS_GLPMCFG_BESL_POS) & OTG_FS_GLPMCFG_BESL_MSK)
#define  OTG_FS_GLPMCFG_REMWAKE             ((uint32_t)    1U  <<  6)
#define  OTG_FS_GLPMCFG_L1SSEN              ((uint32_t)    1U  <<  7)
#define  OTG_FS_GLPMCFG_BESLTHRS_POS        ((uint32_t)           8U)
#define  OTG_FS_GLPMCFG_BESLTHRS_MSK        ((uint32_t)  0x0FU << OTG_FS_GLPMCFG_BESLTHRS_POS)
#define  OTG_FS_GLPMCFG_BESLTHRS(x)        (((uint32_t)    x   << OTG_FS_GLPMCFG_BESLTHRS_POS) & OTG_FS_GLPMCFG_BESLTHRS_MSK)
#define  OTG_FS_GLPMCFG_L1DSEN              ((uint32_t)    1U  << 12)
#define  OTG_FS_GLPMCFG_LPMRSP_POS          ((uint32_t)           13U)
#define  OTG_FS_GLPMCFG_LPMRSP_MSK          ((uint32_t)    3U  << OTG_FS_GLPMCFG_LPMRSP_POS)
#define  OTG_FS_GLPMCFG_LPMRSP(x)          (((uint32_t)    x   << OTG_FS_GLPMCFG_LPMRSP_POS) & OTG_FS_GLPMCFG_LPMRSP_MSK)
#define  OTG_FS_GLPMCFG_SLPSTS              ((uint32_t)    1U  << 15)
#define  OTG_FS_GLPMCFG_L1RSMOK             ((uint32_t)    1U  << 16)
#define  OTG_FS_GLPMCFG_LPMCHIDX_POS        ((uint32_t)           17U)
#define  OTG_FS_GLPMCFG_LPMCHIDX_MSK        ((uint32_t) 0x0FU  << OTG_FS_GLPMCFG_LPMCHIDX_POS)
#define  OTG_FS_GLPMCFG_LPMCHIDX(x)        (((uint32_t)    x   << OTG_FS_GLPMCFG_LPMCHIDX_POS) & OTG_FS_GLPMCFG_LPMCHIDX_MSK)
#define  OTG_FS_GLPMCFG_LPMRCNT_POS         ((uint32_t)           21U)
#define  OTG_FS_GLPMCFG_LPMRCNT_MSK         ((uint32_t)    7U  << OTG_FS_GLPMCFG_LPMRCNT_POS)
#define  OTG_FS_GLPMCFG_LPMRCNT(x)         (((uint32_t)    x   << OTG_FS_GLPMCFG_LPMRCNT_POS) & OTG_FS_GLPMCFG_LPMRCNT)
#define  OTG_FS_GLPMCFG_SNDLPM              ((uint32_t)    1U  << 24)
#define  OTG_FS_GLPMCFG_LPMRCNTSTS_POS      ((uint32_t)           25U)
#define  OTG_FS_GLPMCFG_LPMRCNTSTS_MSK      ((uint32_t)    7U  << OTG_FS_GLPMCFG_LPMRCNTSTS_POS)
#define  OTG_FS_GLPMCFG_LPMRCNTSTS(x)      (((uint32_t)    x   << OTG_FS_GLPMCFG_LPMRCNTSTS_POS) & OTG_FS_GLPMCFG_LPMRCNTSTS_MSK)
#define  OTG_FS_GLPMCFG_ENBESL              ((uint32_t)    1U  << 28)

// OTG_FS Host periodic transmit FIFO size register (OTG_FS_HPTXFSIZ)
#define  OTG_FS_HPTXFSIZ_PTXSA_POS          ((uint32_t)           0U)
#define  OTG_FS_HPTXFSIZ_PTXSA_MSK          ((uint32_t)0xFFFFU      )
#define  OTG_FS_HPTXFSIZ_PTXSA(x)          (((uint32_t)    x        ) & OTG_FS_HPTXFSIZ_PTXSA_MSK)
#define  OTG_FS_HPTXFSIZ_PTXFD_POS          ((uint32_t)           16U)
#define  OTG_FS_HPTXFSIZ_PTXFD_MSK          ((uint32_t)0xFFFFU << OTG_FS_HPTXFSIZ_PTXFD_POS)
#define  OTG_FS_HPTXFSIZ_PTXFD(x)          (((uint32_t)    x   << OTG_FS_HPTXFSIZ_PTXFD_POS) & OTG_FS_HPTXFSIZ_PTXFD_MSK)

// OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXFx)
#define  OTG_FS_DIEPTXFx_INEPTXSA_POS       ((uint32_t)           0U)
#define  OTG_FS_DIEPTXFx_INEPTXSA_MSK       ((uint32_t)0xFFFFU      )
#define  OTG_FS_DIEPTXFx_INEPTXSA(x)       (((uint32_t)    x        ) & OTG_FS_DIEPTXFx_INEPTXSA_MSK)
#define  OTG_FS_DIEPTXFx_INEPTXFD_POS       ((uint32_t)           16U)
#define  OTG_FS_DIEPTXFx_INEPTXFD_MSK       ((uint32_t)0xFFFFU << OTG_FS_DIEPTXFx_INEPTXFD_POS)
#define  OTG_FS_DIEPTXFx_INEPTXFD(x)       (((uint32_t)    x   << OTG_FS_DIEPTXFx_INEPTXFD_POS) & OTG_FS_DIEPTXFx_INEPTXFD_MSK)

// OTG_FS Host configuration register (OTG_FS_HCFG)
#define  OTG_FS_HCFG_FSLSPCS_POS            ((uint32_t)           0U)
#define  OTG_FS_HCFG_FSLSPCS_MSK            ((uint32_t)    3U       )
#define  OTG_FS_HCFG_FSLSPCS(x)            (((uint32_t)    x        ) & OTG_FS_HCFG_FSLSPCS_MSK)
#define  OTG_FS_HCFG_FSLSS                  ((uint32_t)    1U  <<  2)

// OTG_FS Host frame interval register (OTG_FS_HFIR)
#define  OTG_FS_HFIR_FRIVL_POS              ((uint32_t)           0U)
#define  OTG_FS_HFIR_FRIVL_MSK              ((uint32_t)0xFFFFU      )
#define  OTG_FS_HFIR_FRIVL(x)              (((uint32_t)    x        ) & OTG_FS_HFIR_FRIVL_MSK)
#define  OTG_FS_HFIR_RLDCTRL                ((uint32_t)    1U  << 16U)

