xpacks/stm32f7-cmsis/CMSIS/Driver/OTG_FS_STM32F7xx.h
// OTG_FS Host frame number/frame time remaining register (OTG_FS_HFNUM)
#define  OTG_FS_HFNUM_FRNUM_POS             ((uint32_t)           0U)
#define  OTG_FS_HFNUM_FRNUM_MSK             ((uint32_t)0xFFFFU      )
#define  OTG_FS_HFNUM_FRNUM(x)             (((uint32_t)    x        ) & OTG_FS_HFNUM_FRNUM_MSK)
#define  OTG_FS_HFNUM_FTREM_POS             ((uint32_t)           16U)
#define  OTG_FS_HFNUM_FTREM_MSK             ((uint32_t)0xFFFFU << OTG_FS_HFNUM_FRNUM_POS)
#define  OTG_FS_HFNUM_FTREM(x)             (((uint32_t)    x   << OTG_FS_HFNUM_FRNUM_POS) & OTG_FS_HFNUM_FRNUM_MSK)

// OTG_FS Host periodic transmit FIFO/queue status register (OTG_FS_HPTXSTS)
#define  OTG_FS_HPTXSTS_PTXFSAVL_POS        ((uint32_t)           0U)
#define  OTG_FS_HPTXSTS_PTXFSAVL_MSK        ((uint32_t)0xFFFFU      )
#define  OTG_FS_HPTXSTS_PTXFSAVL(x)        (((uint32_t)    x        ) & OTG_FS_HPTXSTS_PTXFSAVL_MSK)
#define  OTG_FS_HPTXSTS_PTXQSAV_POS         ((uint32_t)           16U)
#define  OTG_FS_HPTXSTS_PTXQSAV_MSK         ((uint32_t) 0xFFU  << OTG_FS_HPTXSTS_PTXQSAV_POS)
#define  OTG_FS_HPTXSTS_PTXQSAV(x)         (((uint32_t)    x   << OTG_FS_HPTXSTS_PTXQSAV_POS) & OTG_FS_HPTXSTS_PTXQSAV_MSK)
#define  OTG_FS_HPTXSTS_PTXQTOP_POS         ((uint32_t)           24U)
#define  OTG_FS_HPTXSTS_PTXQTOP_MSK         ((uint32_t) 0xFFU  << OTG_FS_HPTXSTS_PTXQTOP_POS)
#define  OTG_FS_HPTXSTS_PTXQTOP(x)         (((uint32_t)    x   << OTG_FS_HPTXSTS_PTXQTOP_POS) & OTG_FS_HPTXSTS_PTXQTOP_MSK)

// OTG_FS Host all channels interrupt register (OTG_FS_HAINT)
#define  OTG_FS_HAINT_HAINT_POS             ((uint32_t)           0U)
#define  OTG_FS_HAINT_HAINT_MSK             ((uint32_t)0xFFFFU      )
#define  OTG_FS_HAINT_HAINT(x)             (((uint32_t)    x        ) & OTG_FS_HAINT_HAINT_MSK)

// OTG_FS Host all channels interrupt mask register (OTG_FS_HAINTMSK)
#define  OTG_FS_HAINTMSK_HAINTM_POS         ((uint32_t)           0U)
#define  OTG_FS_HAINTMSK_HAINTM_MSK         ((uint32_t)0xFFFFU      )
#define  OTG_FS_HAINTMSK_HAINTM(x)         (((uint32_t)    x        ) & OTG_FS_HAINTMSK_HAINTM_MSK)

// OTG_FS Host port control and status register (OTG_FS_HPRT)
#define  OTG_FS_HPRT_PCSTS                  ((uint32_t)    1U       )
#define  OTG_FS_HPRT_PCDET                  ((uint32_t)    1U  <<  1)
#define  OTG_FS_HPRT_PENA                   ((uint32_t)    1U  <<  2)
#define  OTG_FS_HPRT_PENCHNG                ((uint32_t)    1U  <<  3)
#define  OTG_FS_HPRT_POCA                   ((uint32_t)    1U  <<  4)
#define  OTG_FS_HPRT_POCCHNG                ((uint32_t)    1U  <<  5)
#define  OTG_FS_HPRT_PRES                   ((uint32_t)    1U  <<  6)
#define  OTG_FS_HPRT_PSUSP                  ((uint32_t)    1U  <<  7)
#define  OTG_FS_HPRT_PRST                   ((uint32_t)    1U  <<  8)
#define  OTG_FS_HPRT_PLSTS_POS              ((uint32_t)           10U)
#define  OTG_FS_HPRT_PLSTS_MSK              ((uint32_t)    3U  << OTG_FS_HPRT_PLSTS_POS)
#define  OTG_FS_HPRT_PLSTS(x)              (((uint32_t)    x   << OTG_FS_HPRT_PLSTS_POS) & OTG_FS_HPRT_PLSTS_MSK)
#define  OTG_FS_HPRT_PPWR                   ((uint32_t)    1U  << 12)
#define  OTG_FS_HPRT_PTCTL_POS              ((uint32_t)           13U)
#define  OTG_FS_HPRT_PTCTL_MSK              ((uint32_t) 0x0FU  << OTG_FS_HPRT_PTCTL_POS)
#define  OTG_FS_HPRT_PTCTL(x)              (((uint32_t)    x   << OTG_FS_HPRT_PTCTL_POS) & OTG_FS_HPRT_PTCTL_MSK)
#define  OTG_FS_HPRT_PSPD_POS               ((uint32_t)           17U)
#define  OTG_FS_HPRT_PSPD_MSK               ((uint32_t)    3U  << OTG_FS_HPRT_PSPD_POS)
#define  OTG_FS_HPRT_PSPD(x)               (((uint32_t)    x   << OTG_FS_HPRT_PSPD_POS) & OTG_FS_HPRT_PSPD_MSK)

// OTG_FS Host channel-x characteristics register (OTG_FS_HCCHARx)
#define  OTG_FS_HCCHARx_MPSIZ_POS           ((uint32_t)           0U)
#define  OTG_FS_HCCHARx_MPSIZ_MSK           ((uint32_t)0x7FFU       )
#define  OTG_FS_HCCHARx_MPSIZ(x)           (((uint32_t)    x        ) & OTG_FS_HCCHARx_MPSIZ_MSK)
#define  OTG_FS_HCCHARx_EPNUM_POS           ((uint32_t)           11U)
#define  OTG_FS_HCCHARx_EPNUM_MSK           ((uint32_t) 0x0FU  << OTG_FS_HCCHARx_EPNUM_POS)
#define  OTG_FS_HCCHARx_EPNUM(x)           (((uint32_t)    x   << OTG_FS_HCCHARx_EPNUM_POS) & OTG_FS_HCCHARx_EPNUM_MSK)
#define  OTG_FS_HCCHARx_EPDIR               ((uint32_t)    1U  << 15)
#define  OTG_FS_HCCHARx_LSDEV               ((uint32_t)    1U  << 17)
#define  OTG_FS_HCCHARx_EPTYP_POS           ((uint32_t)           18U)
#define  OTG_FS_HCCHARx_EPTYP_MSK           ((uint32_t)    3U  << OTG_FS_HCCHARx_EPTYP_POS)
#define  OTG_FS_HCCHARx_EPTYP(x)           (((uint32_t)    x   << OTG_FS_HCCHARx_EPTYP_POS) & OTG_FS_HCCHARx_EPTYP_MSK)
#define  OTG_FS_HCCHARx_MCNT_POS            ((uint32_t)           20U)
#define  OTG_FS_HCCHARx_MCNT_MSK            ((uint32_t)    3U  << OTG_FS_HCCHARx_MCNT_POS)
#define  OTG_FS_HCCHARx_MCNT(x)            (((uint32_t)    x   << OTG_FS_HCCHARx_MCNT_POS) & OTG_FS_HCCHARx_MCNT_MSK)
#define  OTG_FS_HCCHARx_DAD_POS             ((uint32_t)           22U)
#define  OTG_FS_HCCHARx_DAD_MSK             ((uint32_t) 0x7FU  << OTG_FS_HCCHARx_DAD_POS)
#define  OTG_FS_HCCHARx_DAD(x)             (((uint32_t)    x   << OTG_FS_HCCHARx_DAD_POS) & OTG_FS_HCCHARx_DAD_MSK)
#define  OTG_FS_HCCHARx_ODDFRM              ((uint32_t)    1U  << 29)
#define  OTG_FS_HCCHARx_CHDIS               ((uint32_t)    1U  << 30)
#define  OTG_FS_HCCHARx_CHENA               ((uint32_t)    1U  << 31)

// OTG_FS Host channel-x interrupt register (OTG_FS_HCINTx)
#define  OTG_FS_HCINTx_XFRC                 ((uint32_t)    1U       )
#define  OTG_FS_HCINTx_CHH                  ((uint32_t)    1U  <<  1)
#define  OTG_FS_HCINTx_STALL                ((uint32_t)    1U  <<  3)
#define  OTG_FS_HCINTx_NAK                  ((uint32_t)    1U  <<  4)
#define  OTG_FS_HCINTx_ACK                  ((uint32_t)    1U  <<  5)
#define  OTG_FS_HCINTx_TXERR                ((uint32_t)    1U  <<  7)
#define  OTG_FS_HCINTx_BBERR                ((uint32_t)    1U  <<  8)
#define  OTG_FS_HCINTx_FRMOR                ((uint32_t)    1U  <<  9)
#define  OTG_FS_HCINTx_DTERR                ((uint32_t)    1U  << 10)
#define  OTG_FS_HCINTx_ERR                  ((uint32_t) 0x0FU  <<  7)

